---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutELAInOption
source: html/2a0e9eae-c041-b249-5d3e-c8c240cb79fc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutELAInOption Property

Electrical Load Areas must be in the Main Model.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPutELAInOption { get; }
```